x = "1"
rate = {'園田賢': 1427.9328955903727, '魚谷侑未': 1636.1543424358567, '萩原聖人': 1481.960971081774, '多井隆晴': 1540.775951015775, '勝又健志': 1532.2631618225425, '瀬戸熊直樹': 1447.2961379195995, '前原雄大': 1508.1227407518215, '朝倉康心': 1493.069000816984, '日向藍子': 1572.1926974656733, '滝沢和典': 1465.6358178958092, '佐々木寿人': 1515.6405795194594, '内川幸太郎': 1485.488788877324, '近藤誠一': 1517.4714668818326, '沢崎誠': 1531.7568862894764, '和久津晶': 1527.0171290349947, '小林剛': 1561.5182029588302, '二階堂亜樹': 1411.8985604154925, '石橋伸洋': 1584.4380176863829, '岡田紗佳': 1480.340734879263, '藤崎智': 1475.9601667196093, '村上淳': 1578.6488786601367, '高宮まり': 1536.5619698607677, '松本吉弘': 1538.1775909818698, '瑞原明奈': 1504.0703644099506, '黒沢咲': 1565.724198771995, '鈴木たろう': 1513.9874626095711, '白鳥翔': 1555.5728954816582, '丸山奏子': 1454.2714736124965, '茅森早香': 1454.1280351138437}


while x == "1":
	for i, j in rate.items():
		print(i.ljust(7,"　") +"：　" +str(j))
	print("選手名を入力してください。　同一選手名や存在しない選手名はエラーとなります。")
	A = input()
	B = input()
	C = input()
	D = input()
	
	player = [A,B,C,D]
	for me in player:
		prob = []
		for enemy in player:
			if enemy != me:
				prob.append(1/(10**((int(rate[enemy]) - int(rate[me]))/400) + 1))
		expectation = prob[0]*(1-prob[1])*(1-prob[2]) + prob[1]*(1-prob[0])*(1-prob[2]) + prob[2]*(1-prob[1])*(1-prob[0]) + 2*(prob[0]*prob[1]*(1-prob[2])) + 2*(prob[2]*prob[1]*(1-prob[0])) + 2*(prob[0]*prob[2]*(1-prob[1])) + 3*prob[0]*prob[1]*prob[2]
		print("")
		print(me)
		print("レート　　　  " +  str(rate[me]))
		print("下人数期待値　" + str(expectation))
		print("1位確率　　 　" + str(prob[0]*prob[1]*prob[2]))
		print("2位確率　　 　" + str((prob[0]*prob[1]*(1-prob[2])) + (prob[2]*prob[1]*(1-prob[0])) + (prob[0]*prob[2]*(1-prob[1]))))		
		print("3位確率　　 　" + str(prob[0]*(1-prob[1])*(1-prob[2]) + prob[1]*(1-prob[0])*(1-prob[2]) + prob[2]*(1-prob[1])*(1-prob[0])))
		print("4位確率　　 　" + str((1 - prob[0])*(1-prob[1])*(1-prob[2])))
	
	print("続ける場合は半角で1を入力、それ以外を入力で終了")
	x = input()